In [1]:
import pandas

In [2]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 33, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']])

In [3]:
type(d)

pandas.core.frame.DataFrame

In [4]:
d

        0   1         2
0    Andy  46  Engineer
1    Jane  33     Nurse
2  Robert  21   Student
3   Maria  30   Student

1. 上面的 0,1,2 指的是：column labels。
2. 旁邊的 0,1,2,3 指的是：index labels。

In [5]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 33, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']],columns = ['Name','Age','Occupation'])

In [6]:
d

     Name  Age Occupation
0    Andy   46   Engineer
1    Jane   33      Nurse
2  Robert   21    Student
3   Maria   30    Student

Columns 的數量，必須要對應到資料的數量。

In [7]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 33, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']],columns = ['Name','Age','Occupation'],index = ['ID1','ID2','ID3','ID4'])

In [8]:
d

       Name  Age Occupation
ID1    Andy   46   Engineer
ID2    Jane   33      Nurse
ID3  Robert   21    Student
ID4   Maria   30    Student

Index 的數量，也必須要對應到資料的數量。

In [9]:
d.Name

ID1      Andy
ID2      Jane
ID3    Robert
ID4     Maria
Name: Name, dtype: object

In [10]:
d.Age

ID1    46
ID2    33
ID3    21
ID4    30
Name: Age, dtype: int64

In [11]:
d.Occupation

ID1    Engineer
ID2       Nurse
ID3     Student
ID4     Student
Name: Occupation, dtype: object

利用 columns 的名字，可以分別取出相對應的值。

In [12]:
type(d.Age)

pandas.core.series.Series

這些資料型態都叫 series object。

In [13]:
d.Age.min()

21

In [14]:
d.Name.max()

'Robert'

In [15]:
d.min()

Name              Andy
Age                 21
Occupation    Engineer
dtype: object

如果直接對 DataFrame 做 min()，則會回傳每一個 column 裡的最小值。